<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>The .pkg contains a postinstall script that creates a launchagent, and has logic for closing/relaunching during updates.</string>
    <key>Description</key>
    <string>Downloads the latest .pkg version of Support App developed by Root3.</string>
    <key>Identifier</key>
    <string>com.github.paul-cossey.download.Support-pkg</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Support</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>Support\..*\.pkg</string>
                <key>github_repo</key>
                <string>root3nl/SupportApp</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
            <key>input_path</key>
            <string>%pathname%</string>
            <key>expected_authority_names</key>
            <array>
                <string>Developer ID Installer: Root3 B.V. (98LJ4XBGYK)</string>
                <string>Developer ID Certification Authority</string>
                <string>Apple Root CA</string>
            </array>
        </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
