<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.0.0 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Downloads the latest version of Causality.</string>
    <key>Identifier</key>
    <string>com.github.paul-cossey.download.Causality</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Causality</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"/scripts-templates\.html\?download=https://releases\.hollywoodcamerawork\.com/cau/(([0-9]+(\.[0-9]+)+)-([0-9]+([a-zA-Z][0-9]+)+))/Causality .* Installer\.dmg\"</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://www.hollywoodcamerawork.com/causality-download.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>href=\"/scripts-templates\.html\?download=https://releases\.hollywoodcamerawork\.com/cau/([0-9]+(\.[0-9]+)+)-([0-9]+([a-zA-Z][0-9]+)+)/Causality (([0-9]+(\.[0-9]+)+)) Installer\.dmg\"</string>
                <key>result_output_var_name</key>
                <string>version1</string>
                <key>url</key>
                <string>https://www.hollywoodcamerawork.com/causality-download.html</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>find</key>
                <string> </string>
                <key>input_string</key>
                <string>https://releases.hollywoodcamerawork.com/cau/%version%/Causality %version1% Installer.dmg</string>
                <key>replace</key>
                <string>%20</string>
            </dict>
            <key>Processor</key>
            <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%output_string%</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Causality.app</string>
                <key>requirement</key>
                <string>identifier "com.hollywoodcamerawork.causality" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GU9BU3F5UM</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Causality.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
    </array>
</dict>
</plist>
