<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Comment</key>
    <string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
    <key>Description</key>
    <string>Installs the latest version of MURAL.</string>
    <key>Identifier</key>
    <string>com.github.paul-cossey.install.MURAL</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MURAL</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.paul-cossey.download.MURAL</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                        <key>destination_path</key>
                        <string>/Applications</string>
                        <key>source_item</key>
                        <string>Mural.app</string>
                    </dict>
                </array>
            </dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
        </dict>
    </array>
</dict>
</plist>
